Repository: alex47/CalorieTracker
Catalog: lib/l10n/app_*.arb
Languages: hu

# appTitle
source: Calorie Tracker
hu: Kalória Követő

# settingsTitle
source: Settings
hu: Beállítások

# aboutTitle
source: About
hu: Névjegy

# weeklySummaryTitle
source: Weekly summary
hu: Heti összesítés

# addButton
source: Add
hu: Hozzáadás

# cancelButton
source: Cancel
hu: Mégse

# acceptButton
source: Accept
hu: Elfogadás

# deleteButton
source: Delete
hu: Törlés

# reestimateButton
source: Re-estimate
hu: Újrabecslés

# caloriesLabel
source: Calories
hu: Kalória

# fatLabel
source: Fat
hu: Zsír

# proteinLabel
source: Protein
hu: Fehérje

# carbsLabel
source: Carbs
hu: Szénhidrát

# foodLabel
source: Food
hu: Étel

# amountLabel
source: Amount
hu: Mennyiség

# notesLabel
source: Notes
hu: Megjegyzések

source: Failed to load daily totals.
hu: A napi összesítők betöltése sikertelen.

source: Tracked foods
hu: Rögzített ételek

source: Failed to load entries.
hu: A bejegyzések betöltése sikertelen.

# emptyEntriesHint
source: No entries for this day yet. Tap Add to log food.
hu: Erre a napra még nincs bejegyzés. Koppints a Hozzáadás gombra.

# noEntriesForWeek
source: No entries for this week.
hu: Erre a hétre nincs bejegyzés.

# languageLabel
source: Language
hu: Nyelv

# languageNameNative
source: English
hu: Magyar

# languageNameEnglish
source: English
hu: Hungarian

# openAiApiKeyLabel
source: OpenAI API key
hu: OpenAI API kulcs

# testKeyButton
source: Test key
hu: Kulcs tesztelése

# modelLabel
source: Model
hu: Modell

# reasoningEffortLabel
source: Reasoning effort
hu: Következtetési szint

# maxOutputTokensLabel
source: Max output tokens
hu: Maximális kimeneti tokenek

# openAiTimeoutSecondsLabel
source: Timeout (seconds)
hu: Időkorlát (másodperc)

# dataToolsSectionTitle
source: Data tools
hu: Adateszközök

# exportDataButton
source: Export data
hu: Adatok exportálása

# importDataButton
source: Import data
hu: Adatok importálása

# exportIncludeApiKeyDialogTitle
source: Export API key?
hu: API kulcs exportálása?

# exportIncludeApiKeyDialogBody
source: Do you want to include your OpenAI API key in the exported file? Warning: this stores the key in plain text.
hu: Szeretnéd belefoglalni az OpenAI API kulcsot az exportált fájlba? Figyelem: ez a kulcsot olvasható (plain text) formában menti.

# exportWithoutApiKeyButton
source: Without API key
hu: API kulcs nélkül

# exportWithApiKeyButton
source: With API key
hu: API kulccsal

# importApiKeyDetectedDialogTitle
source: API key found in backup
hu: API kulcs található a mentésben

# importApiKeyDetectedDialogBody
source: This backup contains an OpenAI API key. Do you want to overwrite the current API key on this device?
hu: Ez a mentés tartalmaz OpenAI API kulcsot. Felülírjuk az eszközön lévő jelenlegi API kulcsot?

# importOverwriteApiKeyButton
source: Overwrite API key
hu: API kulcs felülírása

# importKeepCurrentApiKeyButton
source: Keep current API key
hu: Jelenlegi API kulcs megtartása

source: Export cancelled.
hu: Az export megszakítva.

# exportSuccess
source: Data exported: {path}
hu: Adatok exportálva: {path}

# exportFailed
source: Export failed: {error}
hu: Az export sikertelen: {error}

# importSuccess
source: Data imported: {entriesCount} entries, {itemsCount} food items.
hu: Adatok importálva: {entriesCount} bejegyzés, {itemsCount} étel tétel.

# importFailed
source: Import failed: {error}
hu: Az import sikertelen: {error}

# exportComingSoon
source: Export is coming soon.
hu: Az export hamarosan elérhető.

# importComingSoon
source: Import is coming soon.
hu: Az import hamarosan elérhető.

# couldNotLoadModels
source: Could not load models dynamically. {error}
hu: A modellek dinamikus betöltése nem sikerült. {error}

# enterApiKeyFirst
source: Please enter an API key first.
hu: Először adj meg egy API kulcsot.

# apiKeyTestSucceeded
source: API key test succeeded. Key saved.
hu: Az API kulcs tesztje sikeres. A kulcs mentve.

# apiKeyTestFailed
source: API key test failed: {error}
hu: Az API kulcs tesztje sikertelen: {error}

# setApiKeyInSettings
source: Please set your OpenAI API key in Settings.
hu: Állítsd be az OpenAI API kulcsot a Beállításokban.

# failedToFetchCalories
source: Failed to fetch calories. {error}
hu: A kalóriák lekérése sikertelen. {error}

# requestCaloriesBeforeSaving
source: Please request calories before saving.
hu: Mentés előtt kérj kalóriabecslést.

# addFoodTitle
source: Add food
hu: Étel hozzáadása

# foodAndAmountsLabel
source: Food and amounts
hu: Ételek és mennyiségek

# enterFoodItems
source: Please enter food items.
hu: Adj meg étel tételeket.

# estimateCaloriesButton
source: Estimate calories
hu: Kalória becslése

source: Missing item in AI response.
hu: Hiányzó tétel az AI válaszában.

source: Invalid re-estimated item in AI response.
hu: Érvénytelen újrabecsült tétel az AI válaszában.

# failedToReestimateItem
source: Failed to re-estimate item. {error}
hu: A tétel újrabecslése sikertelen. {error}

# failedToSaveItem
source: Failed to save item. {error}
hu: A tétel mentése sikertelen. {error}

# deleteItemTitle
source: Delete item
hu: Tétel törlése

# deleteItemConfirmMessage
source: Are you sure you want to delete this food item?
hu: Biztosan törölni szeretnéd ezt az étel tételt?

# failedToDeleteItem
source: Failed to delete item. {error}
hu: A tétel törlése sikertelen. {error}

# failedToCopyItem
source: Failed to copy item. {error}
hu: A tétel másolása sikertelen. {error}

# foodDetailsTitle
source: Food details
hu: Étel részletei

# copyToTodayButton
source: Copy to today
hu: Másolás mára

# showAiResponseButton
source: Show AI response
hu: AI válasz megjelenítése

# aiResponseDialogTitle
source: AI response
hu: AI válasz

# copyAiResponseButton
source: Copy response
hu: Válasz másolása

# aiResponseCopiedMessage
source: AI response copied.
hu: Az AI válasz másolva.

# askFollowupChangesLabel
source: Ask for follow-up changes
hu: Kérj további módosításokat

source: Could not open GitHub link.
hu: A GitHub hivatkozás nem nyitható meg.

# updateCheckFailed
source: Update check failed: {error}
hu: Frissítés ellenőrzése sikertelen: {error}

# noApkAssetFound
source: No APK asset found in latest release.
hu: Nem található APK eszköz a legfrissebb kiadásban.

# couldNotOpenUpdateUrl
source: Could not open update download URL.
hu: A frissítés letöltési URL nem nyitható meg.

# updateInstallFailed
source: Update install failed: {error}
hu: A frissítés telepítése sikertelen: {error}

# installerOpenedMessage
source: Installer opened. If prompted, allow installs from this app.
hu: A telepítő megnyílt. Ha kéri, engedélyezd az alkalmazásból történő telepítést.

# aboutDescription
source: Calorie Tracker helps you log meals and estimate calories using OpenAI.
hu: A Kalória Követő segít az étkezések naplózásában és a kalóriák becslésében OpenAI segítségével.

# versionLabel
source: Version: {version}
hu: Verzió: {version}

# checkForUpdatesButton
source: Check for updates
hu: Frissítések keresése

# updateAvailableDialogTitle
source: Update available
hu: Frissítés érhető el

# updateAvailableDialogBody
source: Version {latestVersion} is available.
hu: A(z) {latestVersion} verzió elérhető.

# updateAvailableDialogLater
source: Later
hu: Később

# updateAvailableDialogView
source: Update
hu: Frissítés

# updateAvailableStatus
source: New version available: {latestVersion}
hu: Új verzió elérhető: {latestVersion}

# upToDateStatus
source: You are up to date ({currentVersion}).
hu: Naprakész.

# installLatestApkButton
source: Install latest APK
hu: Legfrissebb APK telepítése

source: Downloading update...
hu: Frissítés letöltése...

# downloadingUpdateProgress
source: Downloading update... {percent}%
hu: Frissítés letöltése... {percent}%

# githubRepositoryButton
source: GitHub repository
hu: GitHub repó

# errorOpenAiRequestTimedOut
source: OpenAI request timed out.
hu: Az OpenAI kérés időtúllépett.

# errorOpenAiRequestFailed
source: OpenAI request failed.
hu: Az OpenAI kérés sikertelen.

# errorNoModelsReturned
source: No models were returned for this API key.
hu: Ehhez az API kulcshoz nem érkezett modell.

# aiSaysPrefix
source: The AI says: {message}
hu: Az AI ezt üzeni: {message}

# errorFailedParseAiResponse
source: Failed to parse AI response.
hu: Az AI válasz feldolgozása sikertelen.

# errorEmptyAiContent
source: AI returned an empty response.
hu: Az AI üres választ adott.

# errorAiNoItemsNoExplanation
source: AI returned no items and no explanation.
hu: Az AI nem adott tételeket és magyarázatot sem.

# errorMissingNameOrAmount
source: Missing food name or amount.
hu: Hiányzik az étel neve vagy mennyisége.

# errorMissingOrInvalidCalories
source: Missing or invalid calories.
hu: Hiányzó vagy érvénytelen kalória.

# errorMissingOrInvalidFat
source: Missing or invalid fat.
hu: Hiányzó vagy érvénytelen zsír.

# errorMissingOrInvalidProtein
source: Missing or invalid protein.
hu: Hiányzó vagy érvénytelen fehérje.

# errorMissingOrInvalidCarbs
source: Missing or invalid carbs.
hu: Hiányzó vagy érvénytelen szénhidrát.

# errorUpdateCheckTimedOut
source: Update check timed out.
hu: A frissítés ellenőrzése időtúllépett.

# errorUpdateCheckFailed
source: Update check failed.
hu: A frissítés ellenőrzése sikertelen.

# errorLatestReleaseTagMissing
source: Latest release tag is missing.
hu: Hiányzik a legfrissebb kiadás címkéje.

# errorApkDownloadFailed
source: APK download failed.
hu: Az APK letöltése sikertelen.

# errorCouldNotOpenInstaller
source: Could not open installer.
hu: A telepítő nem nyitható meg.

# errorInvalidBackupFormat
source: Invalid backup file format.
hu: Érvénytelen biztonsági mentés formátum.

# errorUnsupportedBackupFormatVersion
source: Unsupported backup file version.
hu: Nem támogatott biztonsági mentés verzió.

# errorInvalidSettingsPayload
source: Invalid settings data in backup.
hu: Érvénytelen beállítás adatok a mentésben.

# errorInvalidRowPayload
source: Invalid row data in backup.
hu: Érvénytelen soradatok a mentésben.

# errorInvalidRowPayloadItem
source: Invalid backup row item.
hu: Érvénytelen mentési sorelem.
